[
    {
        "id": 0,
        "task_description": "This task involves app: files, settings. Use the Files app to check if there are any images in the Downloads folder. Then, use the Settings app to navigate to the Calendar app's info and check its battery usage settings.",
        "executed": 0,
        "succeeded": 0
    },
    {
        "id": 1,
        "task_description": "This task involves app: files, settings. Use the Files app to filter the Downloads folder to only show images. Then, navigate to the Settings app and check the storage used by the Files app.",
        "executed": 0,
        "succeeded": 0
    },
    {
        "id": 2,
        "task_description": "This task involves app: files, settings. Use the Files app to show hidden files in the Downloads folder. Then, navigate to the Settings app and set the Calendar app's battery usage to 'Unrestricted'.",
        "executed": 0,
        "succeeded": 0
    },
    {
        "id": 3,
        "task_description": "This task involves app: files, settings. Use the Files app to filter for only image files in the Downloads folder. Then, navigate to the Settings app and check the storage usage of the Files app.",
        "executed": 0,
        "succeeded": 0
    },
    {
        "id": 4,
        "task_description": "This task involves app: files, settings. Use the Files app to sort the Downloads folder by file name (A to Z), then navigate to the Settings app and check the app version number.",
        "executed": 0,
        "succeeded": 0
    },
    {
        "id": 5,
        "task_description": "This task involves app: files, settings. Use the Files app to switch to list view, then navigate to the Settings app and check the permissions for the Files app.",
        "executed": 0,
        "succeeded": 0
    },
    {
        "id": 6,
        "task_description": "This task involves app: files, settings. Use the Files app to switch to list view, then navigate to the Settings app and find the app info page for 'Calendar'.",
        "executed": 0,
        "succeeded": 0
    },
    {
        "id": 7,
        "task_description": "This task involves app: files, settings. Use the Files app to switch to list view, then navigate to the Settings app and view the app info for 'com.google.androidenv.accessibilityforwarder' to check its storage usage.",
        "executed": 0,
        "succeeded": 0
    },
    {
        "id": 8,
        "task_description": "This task involves app: files, settings. In the Files app, switch to list view. Then, in the Settings app, navigate to 'Apps' and check the storage usage of the Files app.",
        "executed": 0,
        "succeeded": 0
    },
    {
        "id": 9,
        "task_description": "This task involves app: files, settings. Use the Files app to check if there are any images in the Downloads folder. Then, use the Settings app to search for 'Storage' and check the available storage space.",
        "executed": 0,
        "succeeded": 0
    },
    {
        "id": 10,
        "task_description": "This task involves app: files, settings. Use the Files app to switch to list view in the Downloads folder. Then, use the Settings app to navigate to the Calendar app's info page and check its storage usage.",
        "executed": 0,
        "succeeded": 0
    },
    {
        "id": 11,
        "task_description": "This task involves app: files, settings. Use the Files app to view all files in the Downloads folder, then navigate to the Settings app and check the storage usage of the Files app.",
        "executed": 0,
        "succeeded": 0
    },
    {
        "id": 12,
        "task_description": "This task involves app: files, settings. Use the Files app to check if there are any audio files in the Downloads folder. Then, use the Settings app to set the battery usage for 'com.google.androidenv.accessibilityforwarder' to 'Restricted'.",
        "executed": 0,
        "succeeded": 0
    }
]